package com.rxn1d.courses;

/**
 * Модифицируйте этот файл
 *
 * @author Ievgen Tararaka
 */
public class HomeWork {

    /**
     * Метод должен вернуть решение квадратического уравнения.
     * <p>Например:
     * Найти решение уравнение вида 5x^2 + 2x + 11
     *
     * @param a коэфициент для x^2
     * @param b коэфициент x
     * @param c константа
     * @return решение уравнения
     */
    public int solveEquation(double a, double b, double c) {
        return 1;
    }

    /**
     * Метод должен вернуть минимальное число
     * из заданного массива.
     * <p>Например:
     * вернуть число=3 при заданном массиве=[5, 4, 3, 4, 5]
     *
     * @param integers заданный массив типа int[]
     * @return минимальное число из массива
     */
    public int min(int[] integers) {
        return 1;
    }

    /**
     * Метод должен вернуть максимальное число
     * из заданного массива.
     * <p>Например:
     * вернуть число=6.0 при заданном массиве=[5.1, 4.33, 3.0, 6.0, 5.999]
     *
     * @param doubles заданный массив типа double[]
     * @return максимальное число из массива
     */
    public int max(double[] doubles) {
        return 1;
    }

    /**
     * Метод должен вернуть среднее арифмитическое число
     * из заданного массива.
     * <p>Например:
     * вернуть число=8 при заданном массиве=[1, 3, 8, 10, 25, 1]
     *
     * @param shorts заданный массив типа short[]
     * @return среднее арифмитическое число из массива
     */
    public int average(short[] shorts) {
        return 1;
    }

    /**
     * Метод должен перевернуть массив.
     * <p>Например:
     * вернуть массив=[f, e, d, c, b, a] из заданного массива=[a, b, c, d, e, f]
     *
     * @param chars заданный массив типа char[]
     * @return перевернутый массив
     */
    public char[] reverse(char[] chars) {
        return new char[1];
    }
}
